import React from 'react'
import './Cookies.css';




function Cookies() {
  return (
    <div>
      <div className="myComponent">
      นโยบายการใช้คุกกี้ (Cookies Policy)
</div>


<div className='Component'>
<p>เว็บไซต์ dullskins.com มีการใช้งานเทคโนโลยีคุกกี้ หรือ เทคโนโลยีอื่นที่มีลักษณะใกล้เคียงกันกับคุกกี้ บนเว็บไซต์ของเรา เพื่อให้ผู้เยี่ยมชมเว็บไซต์ ได้รับประสบการณ์ที่ดีในการเยี่ยมชมเว็บไซต์ และ ช่วยให้เราพัฒนาระบบเว็บไซต์
       ที่สามารถตอบสนองความต้องการของผู้เยี่ยมชมได้อย่างดียิ่งขึ้น</p>
 


</div>
<div className="objective">
คำจำกัดความ
</div>


<div className='objectivet1'>
 <p> - ผู้เยี่ยมชมเว็บไซต์ คือ ผู้ที่เปิดหน้าเว็บไซต์ หรือ อ่านข้อมูลบนหน้าเว็บไซต์ ไม่ว่าจะเป็นหน้าใดก็ตาม</p>
<p> - ระบบเว็บไซต์ คือ ระบบการทำงานของเว็บไซต์ dullskins.com</p>




</div>
<div className="Usage">
คุกกี้ คือ อะไร
</div>


<div className='Usage1'>
<p>คุกกี้ คือ ไฟล์ข้อความขนาดเล็กที่จัดเก็บอยู่บนเครื่องคอมพิวเตอร์ของผู้เยี่ยมชมเว็บไซต์ เมื่อมีการเข้าสู่เว็บไซต์ และ ในแต่ละครั้งที่ผู้เยี่ยมชมเว็บไซต์เข้าสู่หน้าใดของเว็บไซต์ก็ตาม ข้อมูลในคุกกี้
      จะถูกส่งกลับไปยังระบบเว็บไซต์เพื่อประมวลผล หรือ ถูกส่งต่อไปยังเว็บไซต์อื่นๆ ที่รองรับการทำงานของคุกกี้นั้นได้</p>
<p>คุกกี้มีประโยชน์ในการช่วยให้ระบบเว็บไซต์ สามารถจดจำอุปกรณ์ของผู้เยี่ยมชมเว็บไซต์ เพื่อให้บริการที่เหมาะสมกับผู้เยี่ยมชมเว็บไซต์ มากยิ่งขึ้น</p>
<p>คุกกี้ สามารถทำงานได้หลากหลายแบบ เช่น ช่วยให้ผู้เยี่ยมชมเว็บไซต์ได้รับประสบการณ์ที่เหมาะสมในการเยี่ยมชมเว็บไซต์ สำหรับแต่ละอุปกรณ์ จดจำสิ่งที่ผู้เยี่ยมชมเว็บไซต์ชื่นชอบ
      และพัฒนาประสบการณ์การใช้งานของผู้เยี่ยมชมเว็บไซต์</p>
 <p>นอกจากนี้ คุกกี้ที่ dullskins.com ใช้ยังสามารถแบ่งเป็นประเภทต่างๆ ได้ดังนี้</p>


    </div>
    <div className="data">
    คุกกี้ที่จำเป็นต่อการใช้งานเว็บไซต์
</div>
<div className='data1'>
<p>คุกกี้ประเภทนี้ มีความสำคัญ ในการทำให้ผู้เยี่ยมชมเว็บไซต์ สามารถใช้งานเว็บไซต์ และ ฟังก์ชั่นต่างๆ บนเว็บไซต์ของเราได้ รวมถึงช่วยให้ผู้เยี่ยมชมเว็บไซต์ สามารถเข้าถึงข้อมูล และ ใช้เว็บไซต์ ได้อย่างปลอดภัย หากไม่มีคุกกี้ประเภทนี้ เว็บไซต์ dullskins.com
      จะไม่สามารถทำงานได้อย่างปกติ รวมทั้งผู้เยี่ยมชมเว็บไซต์ จะไม่สามารถใช้บริการบางอย่างบนเว็บไซต์ dullskins.com ได้</p>


    </div>
    <div className="Rights">
    คุกกี้ที่ใช้ประมวลผลสถิติและวิเคราะห์การใช้งานเว็บไซต์
</div>
<div className='Rights1'>
<p> - คุกกี้ประเภทนี้ ใช้สำหรับประมวลผลการดำเนินงานของเว็บไซต์ dullskins.com เพื่อให้ระบบเว็บไซต์ เข้าใจถึงความสนใจของผู้เยี่ยมชมเว็บไซต์ เช่น การนับจำนวนผู้เข้าชมเว็บไซต์ การนับจำนวนหน้าที่ผู้เยี่ยมชมเว็บไซต์เข้าใช้งาน การประมวลผลความสนใจและพฤติกรรมการเยี่ยมชมเว็บไซต์ โดยทางเว็บไซต์ dullskins.com จะใช้ข้อมูลดังกล่าว
       เพื่อปรับปรุงประสิทธิภาพการทำงานของเว็บไซต์ เพื่อตอบสนองต่อความต้องการของผู้เยี่ยมชมเว็บไซต์ ให้สามารถใช้งานเว็บไซต์ได้ดียิ่งขึ้น</p>




     </div>
     <div className="safety">
     คุกกี้ที่ใช้สำหรับการตลาดออนไลน์
</div>
<div className='safety1'>
<p>คุกกี้ประเภทนี้จะถูกใช้งานเพื่อเก็บข้อมูลการใช้งานเว็บไซต์ และ ลิงก์ที่ผู้เยี่ยมชมเว็บไซต์มีการเข้าถึงหรือเยี่ยมชม เพื่อให้เข้าใจในความสนใจและพฤติกรรมการเยี่ยมชมเว็บไซต์ ของผู้เยี่ยมชมเว็บไซต์ และ ใช้ในการนำเสนอสิทธิประโยชน์ โฆษณา และ ประชาสัมพันธ์ ให้เหมาะสมกับความสนใจของผู้เยี่ยมชมเว็บไซต์มากที่สุด</p>


     </div>
     
     <div className="contact">
     การตั้งค่าและการปฏิเสธคุกกี้
</div>
<div className='contact1'>
<p>ผู้เยี่ยมชมเว็บไซต์ สามารถเลือกทำการปฎิเสธการทำงานของคุ้กกี้ ได้ตามความต้องการ โดยสามารถตั้งค่าเว็บบราวเซอร์ หรือ ค่าความเป็นส่วนตัวของผู้เยี่ยมชมเว็บไซต์ ด้วยการปฏิเสธการทำงานของคุ้กกี้ทั้งหมด แต่ทั้งนี้ผู้เยี่ยมชมเว็บไซต์ จะไม่สามารถใช้งานบางฟังก์ชั่นบนเว็บไซต์ได้ และ อาจจะทำให้การใช้งานเว็บไซต์ไม่มีประสิทธิภาพเท่าที่ควร</p>
<p>นอกจากการตั้งค่าความเป็นส่วนตัวบนอุปกรณ์ หรือ เว็บบราวเซอร์โดยตรงแล้ว ผู้เยี่ยมชมเว็บไซต์ ยังสามารถปฏิเสธคุกกี้ผ่านทางหน้าต่างแจ้งเตือนบนหน้าเว็บไซต์ได้อีกด้วย แต่ถ้าหากผู้เยี่ยมชมเว็บไซต์ปฏิเสธการใช้งานคุกกี้ทั้งหมด ผู้เยี่ยมชมเว็บไซต์
      จะไม่สามารถใช้งานบางฟังก์ชั่นบนเว็บไซต์ได้ และ อาจจะทำให้ประสบการณ์การใช้งานเว็บไซต์ไม่มีประสิทธิภาพเท่าที่ควร</p>


     </div>


     <div className="agreement">
     ข้อตกลงการใช้บริการเว็บไซต์
</div>
<div className='agreement1'>
<p>ผู้เยี่ยมชมเว็บไซต์ สามารถเลือกทำการปฎิเสธการทำงานของคุ้กกี้ ได้ตามความต้องการ โดยสามารถตั้งค่าเว็บบราวเซอร์ หรือ ค่าความเป็นส่วนตัวของผู้เยี่ยมชมเว็บไซต์ ด้วยการปฏิเสธการทำงานของคุ้กกี้ทั้งหมด แต่ทั้งนี้ผู้เยี่ยมชมเว็บไซต์ จะไม่สามารถใช้งานบางฟังก์ชั่นบนเว็บไซต์ได้ และ อาจจะทำให้การใช้งานเว็บไซต์ไม่มีประสิทธิภาพเท่าที่ควร</p>
<p>นอกจากการตั้งค่าความเป็นส่วนตัวบนอุปกรณ์ หรือ เว็บบราวเซอร์โดยตรงแล้ว ผู้เยี่ยมชมเว็บไซต์ ยังสามารถปฏิเสธคุกกี้ผ่านทางหน้าต่างแจ้งเตือนบนหน้าเว็บไซต์ได้อีกด้วย แต่ถ้าหากผู้เยี่ยมชมเว็บไซต์ปฏิเสธการใช้งานคุกกี้ทั้งหมด ผู้เยี่ยมชมเว็บไซต์
      จะไม่สามารถใช้งานบางฟังก์ชั่นบนเว็บไซต์ได้ และ อาจจะทำให้ประสบการณ์การใช้งานเว็บไซต์ไม่มีประสิทธิภาพเท่าที่ควร</p>


      </div>
      <div className=" contact">
      ท่านจะติดต่อ dullskins.com และเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล ได้อย่างไร
</div>
<div className='contact1'>
<p>หากท่านมีข้อเสนอแนะ หรือต้องการสอบถามข้อมูลเกี่ยวกับรายละเอียดการเก็บรวบรวม ใช้ และ/หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน รวมถึงการขอใช้สิทธิตามนโยบายฉบับนี้ ท่านสามารถติดต่อ ผ่านช่องทางต่อไปนี้</p>
<p> - Facebook: Coffee by nano กาแฟดี..ที่”ห่วงใย”สุขภาพ</p>
<p> - Line: nanoverse</p>
<p>จัดทำนโยบายโดย nanoverse (nanoverse.co.th)</p>






      </div>




     
     </div>
  )


}




export default Cookies
