import React from 'react'
import './Article.css';


function Article1() {
  return (
    <div>
      <div className="myComponent">
      นโยบายความเป็นส่วนตัวของข้อมูล (Privacy Policy)
</div>


<div className='Component'>
<p>เว็บไซต์ของเรา dullskins.com เคารพสิทธิความเป็นส่วนตัวของผู้ใช้ทุกคนที่เข้าเว็บไซต์ของเรา จึงขอชี้แจงให้ท่านทราบเกี่ยวกับการใช้งานข้อมูลส่วนบุคคลของท่าน </p>
 <p>ประกาศนโยบายความเป็นส่วนตัวนี้ใช้สำหรับบุคคลดังต่อไปนี้</p>
<p> - ผู้ให้บริการหรือเจ้าของเว็บไซต์ ต่อไปนี้จะเรียกว่า dullskins.com</p>
<p> - ผู้เยี่ยมชมเว็บไซต์ คือ ผู้ที่เปิดหน้าเว็บไซต์ หรือ อ่านข้อมูลบนหน้าเว็บไซต์ dullskins.com
 ไม่ว่าจะเป็นหน้าใดก็ตาม</p>
<p>เว็บไซต์ dullskins.com ได้กำหนดนโยบายเกี่ยวกับข้อมูลส่วนบุคคลเพื่อยกระดับมาตรฐาน ความปลอดภัย ของข้อมูลส่วนบุคคล ของผู้เยี่ยมชม
    และ ผู้ใช้บริการเว็บไซต์ให้ดียิ่งขึ้น และ เพื่อให้สอดคล้องกับพระราชบัญญัติ คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562</p>
<p>ดังนั้น เราขอแนะนำให้ท่านอ่านนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ เพื่อเรียนรู้และเข้าใจหลักปฏิบัติที่เว็บไซต์ dullskins.com ยึดถือในการปฏิบัติต่อข้อมูลส่วนบุคคลของท่าน </p>


</div>
<div className="objective">
วัตถุประสงค์ของการจัดเก็บข้อมูลส่วนบุคคล
</div>


<div className='objectivet1'>
<p>nanoverse.co.th เก็บข้อมูลส่วนบุคคลของท่านตามวัตถุประสงค์ ของการดำเนินงานเว็บไซต์ดังนี้ </p>
 <p> - เพื่อใช้ในกิจกรรมทางการตลาดออนไลน์ และ การโฆษณา</p>
<p> - เพื่อใช้ในวิเคราะห์ข้อมูลผู้เยี่ยมชมเว็บไซต์ และ วิจัยทางการตลาด</p>
<p> - เพื่อใช้ในการพัฒนาเว็บไซต์ และ มอบประสบการณ์เฉพาะบุคคลใหักับผู้เยี่ยมชมเว็บไซต์</p>


</div>
<div className="Usage">
การใช้งานคุกกี้บนเว็บไซต์ dullskins.com




</div>
<div className='Usage1'>
<p>เว็บไซต์ dullskins.com มีการใช้งานคุกกี้ เพื่อวัตถุประสงค์ทางการดำเนินงานของเว็บไซต์ ท่านสามารถศึกษาข้อมูลเพิ่มเติมเกี่ยวกับ นโยบายการใช้งานคุกกี้บนเว็บไซต์ dullskins.com ได้จาก นโยบายการใช้คุกกี้ (Cookie Policy) ของเรา </p>
    </div>
    <div className="data">
    ข้อมูลส่วนบุคคลที่จัดเก็บโดย บุคคลที่สาม
</div>
<div className='data1'>
<p>เว็บไซต์ dullskins.com มีการใช้งาน ซอฟท์แวร์ และ บริการจาก บุคคลที่สาม สำหรับเพิ่มประสิทธิภาพการทำงานของเว็บไซต์ โดยบริการที่เว็บไซต์ใช้มีดังนี้</p>
<p> - Google Analytics</p>
<p> - Facebook Pixel/Conversion API</p>
<p> - Google Maps Embedded</p>
<p> - Youtube Embedded</p>
<p>กรณีที่มีการเชื่อมโยงกับแพลตฟอร์มของบุคคลที่สาม เช่น เครือข่ายการโฆษณา สื่อสังคมออนไลน์ ผู้ให้บริการเว็บไซต์ภายนอกอื่นๆ คุกกี้บางประเภท และ ข้อมูลจราจรทางคอมพิวเตอร์ อาจมีการจัดการโดยบุคคลที่สาม จึงแนะนำให้ผู้เยี่ยมชมเว็บไซต์
    ศึกษาและทำความเข้าใจนโยบายการใช้คุกกี้และนโยบายการคุ้มครองข้อมูลส่วนบุคคลของบุคคลที่สามเพิ่มเติมด้วย</p>
    </div>






    <div className="Rights">
    สิทธิของเจ้าของข้อมูลส่วนบุคคล
</div>
<div className='Rights1'>
<p> - ผู้เยี่ยมชมเว็บไซต์ สามารถปฎิเสธ การใช้งานคุกกี้ ได้จาก หน้าต่างแจ้งเตือนการใช้งานคุกกี้ ที่หน้าเว็บไซต์</p>
<p> - ผู้เยี่ยมชมเว็บไซต์ สามารถลบข้อมูลคุกกี้ทั้งหมด ได้จากเว็บบราวเซอร์ที่ผู้เยี่ยมชมเว็บไซต์ ใช้งาน โดยท่านสามารถศึกษาวิธีการลบคุกกี้ ออกจากเว็บบราวเซอร์ จากเว็บไซต์ของผู้พัฒนาเว็บบราวเซอร์นั้น</p>


     </div>
     <div className="safety">
     ความปลอดภัยของข้อมูลส่วนบุคคล
</div>
<div className='safety1'>
<p>บนเว็บไซต์ dullskins.com อาจจะมีลิงก์เชื่อมโยงไปยังเว็บไซต์อื่นๆ หรือท่านอาจใช้ลิงก์ในเว็บไซต์อื่นเพื่อเข้ามาในเว็บไซต์ของเรา เราขอให้ท่านเข้าใจว่า เว็บไซต์ dullskins.com ไม่สามารถที่จะรับผิดชอบต่อนโยบาย และวิธีการปฏิบัติเกี่ยวกับการคุ้มครองความเป็นส่วนตัวของเว็บไซต์อื่นๆได้ ดังนั้นขอให้ท่านศึกษา นโยบาย และ แนวทางปฏิบัติเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล
    ของเว็บไซต์ ที่ท่านเยี่ยมชม ก่อนและหลังเยี่ยมชมเว็บไซต์ของเราผ่านลิงก์เชื่อมโยงบนเว็บไซต์ด้วย</p>
<p>อย่างไรก็ตามเว็บไซต์ dullskins.com ไม่สามารถที่จะควบคุมดูแล หรือรับผิดชอบต่อการใช้ข้อมูลส่วนตัวโดยบุคคลภายนอก หรือ องค์กรภายนอก ที่ได้รับข้อมูลจากท่านผ่านทางเว็บไซต์นี้ เราจึงขอแนะนำให้ท่านพิจารณา การยอมรับหรือการปฏิเสธการใช้งานคุกกี้ จากบุคคลที่สาม
     ตามที่เราได้แจ้งข้างต้นถึงสิทธิที่ท่านสามารถปฏิเสธการใช้งานคุกกี้เหล่านี้ได้ด้วยตนเอง</p>


     </div>
     
     <div className="contact">
     ท่านจะติดต่อ dullskins.com และเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล ได้อย่างไร
</div>
<div className='contact1'>
<p>หากท่านมีข้อเสนอแนะ หรือต้องการสอบถามข้อมูลเกี่ยวกับรายละเอียดการเก็บรวบรวม ใช้ และ/หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน รวมถึงการขอใช้สิทธิตามนโยบายฉบับนี้ ท่านสามารถติดต่อ ผ่านช่องทางต่อไปนี้</p>
<p> - Facebook: Coffee by nano กาแฟดี..ที่”ห่วงใย”สุขภาพ</p>
<p> - Line: nanoverse</p>
<p> - จัดทำนโยบายโดย nanoverse (nanoverse.co.th)</p>


     </div>


     </div>
  )


}




export default Article1